//#include <stdio.h>
//int main()
//{
//    int arr1[2][2] = { {10,20},{30,40} };
//    int arr2[2][2];
//    arr2[0][0] = 10;
//    arr2[0][1] = 20;
//    arr2[1][0] = 30;
//    arr2[1][1] = 40;
//    int i, j;
//    for (i = 0; i <=1; i++)
//    {
//        for (j = 0; j <=1; j++)
//        {
//            printf("%d ", arr1[i][j]);
//        }
//    }
//    printf("\n");
//    i = 0;
//    j = 0;
//    for (i = 0; i <= 1; i++)
//    {
//        for (j = 0; j <= 1; j++)
//        {
//            printf("%d ", arr2[i][j]);
//        }
//    }
//    return 0;
//}
//多维数组定义的时候可以不定义行，但是必须定义列